tutorials/modules/incompressibleVoF/damBreakPorousBaffle/0/p_rgh.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    rightWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    lowerWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    atmosphere
    {
        type            prghTotalPressure;
        p0              $internalField;
        value           $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
